// 02.ClassStart.cpp : Defines the entry point for the console application.
//

#include "stdafx.h"
// C에서는 
// 데이터구조(struct)
// 처리구조(Func)분리

// C++에서는
// 둘은 한번에 표편할수 있다.

// -> class를 쓴다.
// 우리가 Start에서 말햇듯이 사람이 "절차지향(컴퓨터적 으로..)"
// 생각하다보면 뇌사! 한다.

// 좀더 사람답게 분류를 하기위해서
// 객체 지향이 생겼다.

// 그것을 표현하기 위한 문법 중
// class가 있다.

// 내가 class 객체 -> 객체를 불러오기 위한 정보를 
// class에서 기본적으로 가지고 있는것들을 불러온다.

// 객체지향 5원칙
// 객체지향 4특성
// -> 곰곰히 생각해보면 우리가 분류를 하려고 하려면 저런 원칙과 특성이 필요하다.

// 이후에 설명을 적겟다.

// 객체지향 5원칙

// 객체지향 4특성

int main()
{
    return 0;
}

